import { ReactElement } from "react";
import TextAnimation from "./TextAnimation";

const Text = (): ReactElement => {
  return (
    <section id="souseki">
      <TextAnimation section="souseki">
        Sea10と書いてしーてんと読む
        <br />
        この名前がどこで生れたか、そのうちわかるであろう
        <br />
        <br />
        訳）Sea10と呼んでいただけると跳んで喜びます！仲良くしてください！
        <br />
        <br />
        ・・・・・それから、
        <br />
        <br />
        九州工業大学情報工学部二年に在籍しています。
        <br />
        2023年はWebに片足(いや、両足？)を突っ込み、ハッカソンなどに参加しつつ、フロントエンドを勉強していました。
        <br />
        技術: TypeScript,CSS,Next.js,Reactとか...
        <br />
        このフロントエンドの勉強は2024年も継続しますが、半年ほど前からWebデザインの沼にハマり、デザインを熱心に勉強中です。
        <br />
        使用ツール:Figma,Adobe(Illustrator,Photoshop),Canva,とか、、Canvaはポスターでスライド作成、素材作成とかに使ってます。（最近、AIに素材の生成を頼ったり、自分が描いたイラストを補正してもらったり。）
        <br />
        個人的な趣味としては、年末年始にやった砂絵がなかなか面白く、砂にハマってました。
        <br />
        安倍公房さんの「砂の女」を読んだ時の衝撃を再度認識したような....砂ってなんだろうとか、砂ができることをひたすら考えたりしてスタートした2024年です。
        <br />
        アニメーションをよく作ります。上手くはないんですが、、、ぁぁ、自分が今まで作ってきたものはInstagramに載せてあるのでぜひ遊びにきてくださると嬉しいです。
        <br />
        絵やアニメーションを描いていくと自分の中でまとまっていなかったものを整理できるようで、定期的に何かつくったりしています。
        <br />
        あと、日々のつぶやきであったりはTwitterに描いてあるので、、ぜひこちらも....
        <br />
        基本的に頭の回転はそれほど速くないので意見交換をする際はテキストコミュニケーションの方が得意だと自覚しています。
        <br />
        物事に対して考える時間は異常に長いです。異常に長いですし、興味の分野の幅が広いので考えているトピックが尽きることはないんだと思っています。
        <br />
        言語化に関しては、SecHack365の思索駆動コースで意識的に訓練した（自分の中では）ので、これから先も頑張るぞいって感じです。
        <br />
        <br />
        あとは、、とにかく、デザインが好きです。デザインに興味を持ち出したきっかけは、「Design for the other 90%」というプロジェクトを見たときに、「デザインって制約の中で試行錯誤してものづくりを行うことなんだ！」と気づいたことです。
        <br />
        UX５層でいうところの表層のデザインあたりを実際にプロダクトをつくることを通して学んでいますが、まだまだです。
        <br />
        それから、ダークパターンに関して調べています。人を騙すようなUIというのは、デザインを作っていても無意識にやってしまうことかもしれないと危機感を抱いたというのもありますが、ユーザー自身がダークパターンか否かの判断ができ、無意識のうちに意思決定を曲げられることがないような、最近はそんな社会が理想だなぁと思っています。
        <br />
        これに関してはOpenDarkPatternsっていうサイトを作成中なので、こういったデザインに関して話し合えるような場所を広げていけたらいいなと思っています。
        <br />
        デザインもアートも思考の積み重ねであり、ものづくりには不可欠なものだと思ってます。
        <br />
        え、、、っと、、こんな感じの人間です。あとは、、このサイトを楽しんでいただければ。
        <br />
      </TextAnimation>
    </section>
  );
};

export default Text;
